{"title": "Rust の所有権を理解する", "body": "[Rustの公式ドキュメント](https://rust-lang-ja.github.io/the-rust-programming-language-ja/1.6/book/ownership.html)をじっくり咀嚼して、Rustコードを読み書きするしかないけどまずは概念をある程度理解していないと難しいので、できるだけ仲良くなろう。\n\nそのためにも静的型付けのコンパイル言語という未経験なパラダイムということもあるので語学のためにも一言一句レベルで馬鹿丁寧にドキュメントを読み砕く。\n\n特に、所有権、借用、参照は必ず理解しておきたいのでここでみておく。\n\n# 所有権\n> Rustでは 変数束縛 はある特性を持ちます。それは、束縛されているものの「所有権を持つ」ということです。 これは束縛がスコープから外れるとき、Rustは束縛されているリソースを解放するだろうということを意味します。\n\nとある。これはつまりこういうことだ。\n\n```rust\n{\n  let hoge = \"var\";  // 束縛\n  println!(\"{}\", hoge);\n}\n// スコープから外れたのでリソースを解放している。\n// そのため、hoge を参照しようとするとエラーが発生。\nprintln!(\"{}\", hoge);\n// error[E0425]: unresolved name `hoge`\n//  --> src/main.rs:6:20\n//    |\n//  6 |     println!(\"{}\", hoge);\n//    |                    ^^^^ unresolved name\n// error: aborting due to previous error\n```\n\n言い換えると、`letを用いた変数束縛は、束縛されたスコープ内でのみ生存可能なリソースの所有権を持つ`という特性を持つと言えそうだ。\n\n# ムーブセマンティクス\n\n> しかし、ここではもっと微妙なことがあります。それは、Rustは与えられたリソースに対する束縛が 1つだけ あるということを保証するということです。\n\nここではリソースに対する束縛、つまり所有権が1つだけであることを保証するRustについて微妙だと言っている。そして以下のような例が挙げられている。\n\n```rust\nlet v = vec![1, 2, 3];\nlet v2 = v;\nprintln!(\"{}\", v[0]);\n// error[E0382]: use of moved value: `v`\n//  --> src/main.rs:4:20\n//    |\n//  3 |     let v2 = v;\n//    |         -- value moved here\n//  4 |     println!(\"{}\", v[0]);\n//    |                    ^ value used here after move\n//    |\n//    = note: move occurs because `v` has type `std::vec::Vec<i32>`, which does not implement the `Copy` trait\n// error: aborting due to previous error\n```\nここで発生したエラーの内容はムーブされた変数`v`を使うなということである。\n\n> 所有権を何か別のものに転送するとき、参照するものを「ムーブした」と言います。\n\nこれは別に微妙でもなんでもなくて、リソースを所有できるのは常に唯一なんらかのオブジェクトであることがわかる。だから`v`が所有していたリソースの`v2`への転送(ムーブ)と表現しているわけだ。\n\nこの動作の詳細についての解説がされている。\n\n> ベクタオブジェクトは スタック に保存され、 ヒープ に保存された内容（ [1, 2, 3] ）へのポインタを含みます。v を v2 にムーブするとき、それは v2 のためにそのポインタのコピーを作ります。 それは、ヒープ上のベクタの内容へのポインタが2つあることを意味します。\n\nとのことで、確かにこれで`v`と`v2`からデータ競合が起きる可能性があるためRustがそれを排除するのは自然だ。それよりも重要なのはムーブにはポインタのコピーを伴うということだ。これは`v`が所有するリソースが保存されているアドレスと異なるアドレスに`v2`のオブジェクトが格納され、それに伴ってポインタのコピーが発生するということだろう。\n\nだとしたらムーブというのは厳密には転送ではなくてコピーということなのではないだろうか。これはコンパイラの実装を見て理解できるのかどうかも怪しいがなんとも言えない。\n\n# Copy型\n`Copy`とは\n> 所有権が他の束縛に転送されるとき、元の束縛を使うことができないということを証明しました。 しかし、この挙動を変更する トレイト があります。\n\nと言っているトレイトである。上のコード例でも`Copy`トレイトが実装されていない`Vec<i32>`型の`v`のムーブだったため`v2`にムーブした後に`v`を使うことができずにエラーが出ていた。つまり`Copy`が実装されている型であれば万事解決というわけだ。\n\n```rust\nlet v = 1;\nlet v2 = v;\nprintln!(\"{}\", v);\n```\n\nこれは実際成功する。なぜなら`i32`は`Copy`を実装しているからだ。でもムーブが発生しているし、データの競合は起きるのでは？という疑問がある。それについては\n\n> これはちょうどムーブと同じように、 v を v2 に割り当てるとき、データのコピーが作られるということを意味します。 しかし、ムーブと違って後でまだ v を使うことができます。 これは i32 がどこか別の場所へのポインタを持たず、コピーが完全コピーだからです。\n\nということらしい。`Copy`の実装がされていればムーブは実質的に完全コピー、見かけは同じでもメモリ上は全く別物のリソースとなるため所有権は完全に独立している。そのためRustのルールから逸脱していないわけだ。\n\n> 全てのプリミティブ型は Copy トレイトを実装しているので、推測どおりそれらの所有権は「所有権ルール」に従ってはムーブしません。\n\nとある。`「所有権ルール」に従っては`という表現は何か行間がありそうだが、単純にコピーをしていると読み替えても問題はなさそうだ。なぜなら上で推察した通り、それは1つのリソースが複数所有されているわけではないからだ。\n\n# 所有権を越えて\n関数への実引数として束縛した変数を渡すとムーブが起きる。そのため、関数の呼び出し元は関数がその所有権を返すようにしてもらわねばならない。\n\n```rust\nfn foo(v1: Vec<i32>, v2: Vec<i32>) -> (Vec<i32>, Vec<i32>, i32) {\n  // `Copy`を実装しない`Vec`であるため`v`についてはムーブが起きる　\n  // そのため、持ち主に対して所有権を返す必要がある\n  (v1, v2, 42)\n}\n\nlet v1 = vec![1, 2, 3];\nlet v2 = vec![1, 2, 3];\n\nlet (v1, v2, n) = foo(v1, v2);\n```\n\nこれはなんとも手間だ。しかしこれはRustがもともと提供する借用という機能を使うことで簡単に解決できる。\n\n# 借用\n借用を用いたコードはこのようになる\n\n```rust\nfn foo(v1: &Vec<i32>, v2: &Vec<i32>) -> Vec<i32> {\n  42\n}\n\nlet v1 = vec![1, 2, 3];\nlet v2 = vec![1, 2, 3];\n\nlet n = foo(&v1, &v2);\n// コンパイルが通る\nprintln!(\"{}, {}\", v1[0], v2[0]);\n```\n\n> 引数として Vec<i32> を使う代わりに、参照、つまり &Vec<i32> を使います。 そして、 v1 と v2 を直接渡す代わりに、 &v1 と &v2 を渡します。\n\n`&Vec<i32`を「参照」であるといい、`&v1`とすることで`v1`を直接渡さなくて済むという。つまり参照を渡すと所有権の転送であるムーブは起きないということだろう。実際にこう解説されている。\n\n> &T 型は「参照」と呼ばれ、それは、リソースを所有するのではなく、所有権を借用します。\n\n参照をムーブが起きうる箇所で渡すことを所有権の借用という。\n\n> 何かを借用した束縛はそれがスコープから外れるときにリソースを割当解除しません。 これは foo() の呼出しの後に元の束縛を再び使うことができることを意味します。\n\n所有権の項で見た通り、束縛は本来「所有権を持つ」ことを言うが、その所有権が借用だった場合はリソースが解放されずに済む。当然のことだがとても大切だ。\n\n> 参照は束縛とちょうど同じようにイミュータブルです。 これは foo() の中ではベクタは全く変更できないことを意味します。\n\nこれは安全にリソースを扱うRustの心意気という感じだが、普通に`&T`はイミュータブルなものとして扱われる。\n\nここまでの事実を整理すると借用とは\n\n- `&T`の形式で表すリソースの参照を使う\n- 所有権のムーブを回避し、束縛のスコープが終わってもリソースの解放をしない\n- 特に指定がない限りはイミュータブル\n\nということが明らかになった。\n\n# &mut参照\nミュータブルな束縛があるように、参照にもミュータブルなものがある。\n> 参照には2つ目の種類、 &mut T があります。 「ミュータブルな参照」によって借用しているリソースを変更することができるようになります。\n\n```rust\nlet mut x = 5;\n{\n  let y = &mut x;\n  *y += 1;\n}\nprintln!(\"{}\", x);\n```\n\n> y を x へのミュータブルな参照にして、それから y の指示先に1を足します。 x も mut とマークしなければならないことに気付くでしょう。 そうしないと、イミュータブルな値へのミュータブルな借用ということになってしまい、使うことができなくなってしまいます。\n\nこれは今まで得た知識で理解できることだ。ミュータブルな参照を借用した束縛は当然値を変更できる。\n\n>   アスタリスク（ * ）を y の前に追加して、それを *y にしたことにも気付くでしょう。これは、 y が &mut 参照だからです。\n\nアスタリスクを追加する理由として`y`が&mut参照であることが述べられている。値を変更するということはその実体にアクセスして書き換えねばならない。参照の内容にアクセするにはアスタリスクを使用する必要があるということだ。\n\n> それ以外は、 &mut 参照は普通の参照と全く同じです。 しかし、2つの間には、そしてそれらがどのように相互作用するかには大きな違いが あります 。前の例で何かが怪しいと思ったかもしれません。なぜなら、 { と } を使って追加のスコープを必要とするからです。 もしそれらを削除すれば、次のようなエラーが出ます。\n\nこの理由として借用についてのルールが挙げられている。\n\n- 借用は全て所有者のスコープより長く存続してはいけない\n- 借用は`リソースに対する1つ以上の参照(&T)`または`ただ1つのミュータブルな参照(&mut T)`のどちらかを持つことがありうるが、両方同時に持つことはない\n\n1つ目の借用がスコープが終わってもなお存在してしまった場合、本来の所有者と借用しているものが同スコープに並存してしまうことになる。これはRust的にはおかしいことだ。\n\n2つ目はこれもリソースに対して所有権が1つしかあり得ないこととほぼ同じ制約だろう。\n\nいずれにせよ、Rustはデータ競合を排除している。\n\n# スコープの考え方\nドキュメントでは借用のルールを踏まえてスコープの考え方に立ち返っている。\n\nこのコードはエラーを出す。\n```rust\nlet mut x = 5;\n// x をミュータブルな借用をしている。\nlet y = &mut x;\n\n// x と同じスコープで借用しているリソースを更新\n*y += 1;\n\n// 2つ目のルールに違反。また、このエラーは所有者のイミュータブルな参照をしようとしているため発生している。\nprintln!(\"{}\", x);\n// error: cannot borrow `x` as immutable because it is also borrowed as mutable\n//     println!(\"{}\", x);\n//                    ^\n```\n\n> 必要なものは、 println! を呼び出し、イミュータブルな借用を作ろうとする 前に 終わるミュータブルな借用です。 Rustでは借用はその有効なスコープと結び付けられます。 そしてスコープはこのように見えます。\n\n```rust\nlet mut x = 5;\n\nlet y = &mut x;    // -+ xの&mut借用がここから始まる\n                   //  |\n*y += 1;           //  |\n                   //  |\nprintln!(\"{}\", x); // -+ - ここでxを借用しようとする\n                   // -+ xの&mut借用がここで終わる\n```\n\n`pintln!`で`x`を渡すのはムーブが起きるのではないのかという疑問は起きつつもこれはどうやら借用であるらしい。それによって起きるルール違反でコンパイルエラーが出るというわけだ。\n\nここからわかることは借用をする場合は所有者とのスコープの衝突を避けることを知っておかなければならない。\n\n# 借用が回避する問題\n> なぜこのような厳格なルールがあるのでしょうか。 そう、前述したように、それらのルールはデータ競合を回避します。\n\n借用の存在意義はデータ競合の回避だと言っている。例えば\n\n## イテレータの無効\n> 一例は「イテレータの無効」です。それは繰返しを行っているコレクションを変更しようとするときに起こります。 Rustの借用チェッカはこれの発生を回避します。\n\n```rust\nlet mut v = vec![1, 2, 3];\n\nfor i in &v {\n    println!(\"{}\", i);\n}\n```\n\n`Vec<i32>`のミュータブルな束縛である`v`をイミュータブルな借用でイテレートしている。この借用は`for`のスコープのみ有効である。\n\n```rust\nlet mut v = vec![1, 2, 3];\n\nfor i in &v {\n    println!(\"{}\", i);\n        v.push(34);\n}\n//  error: cannot borrow `v` as mutable because it is also borrowed as immutable\n//     v.push(34);\n//     ^\n// note: previous borrow of `v` occurs here; the immutable borrow prevents\n// subsequent moves or mutable borrows of `v` until the borrow ends\n// for i in &v {\n//           ^\n// note: previous borrow ends here\n// for i in &v {\n//     println!(“{}”, i);\n//     v.push(34);\n// }\n// ^\n```\n\nミュータブルな束縛であっても借用の仕方によって不意な変更を避けることができることがわかった。　\n\n## 解放後の使用\n> 参照はそれらの指示するリソースよりも長く生存することはできません。 Rustはこれが真であることを保証するために、参照のスコープをチェックするでしょう。\n\nこれも前述のルール通りだ。\n\n```rust\nlet y: &i32;\n{\n    let x = 5;\n    y = &x;\n}\n\nprintln!(\"{}\", y);\n// error: `x` does not live long enough\n//     y = &x;\n//          ^\n// note: reference must be valid for the block suffix following statement 0 at\n// 2:16...\n// let y: &i32;\n// {\n//     let x = 5;\n//     y = &x;\n// }\n//\n// note: ...but borrowed value is only valid for the block suffix following\n// statement 0 at 4:18\n//     let x = 5;\n//     y = &x;\n// }\n```\n\nこれは少し分かりづらい。まず、外側のスコープで`i32`の参照を束縛するために`y`を宣言した。内側のスコープでは`i32`である5を`x`に束縛し、その参照を`y`に束縛しようとした。コンパイラはそこでエラーを出している。\nなぜなら、内側のスコープを抜けた瞬間に`x`のリソースは解放されてメモリ上から存在をなくしているため、存在しない`x`の参照を持つ`y`が外側のスコープで生きているからである。\n\n> 言い換えると、 y は x が存在するスコープの中でだけ有効だということです。 x がなくなるとすぐに、それを指示することは不正になります。 そのように、エラーは借用が「十分長く生存していない」ことを示します。なぜなら、それが正しい期間有効ではないからです。\n\nこれはすごく安全という印象を受ける。\n\nまた\n\n> 参照がそれの参照する変数より 前に 宣言されたとき、同じ問題が起こります。 これは同じスコープにあるリソースはそれらの宣言された順番と逆に解放されるからです。\n\n```rust\nlet y: &i32;\nlet x = 5;\ny = &x;\n\nprintln!(\"{}\", y);\n// error: `x` does not live long enough\n// y = &x;\n//      ^\n// note: reference must be valid for the block suffix following statement 0 at\n// 2:16...\n//     let y: &i32;\n//     let x = 5;\n//     y = &x;\n//\n//     println!(\"{}\", y);\n// }\n//\n// note: ...but borrowed value is only valid for the block suffix following\n// statement 1 at 3:14\n//     let x = 5;\n//     y = &x;\n//\n//     println!(\"{}\", y);\n// }\n```\n\n参照(`&x`)がそれの参照する変数(`y`)と読み替えられる。つまり`x`より先に宣言した`y`は`x`より寿命が長いためにエラーが出ているということだ。\n\n> 前の例では、 y は x より前に宣言されています。それは、 y が x より長く生存することを意味し、それは許されません。\n\nそう、自分より寿命の短い変数の参照はどうあがいても取得できないためである。\n\n\nなんかあとライフタイムが続くぽいが長くなったので分割。", "publish": true, "tags": ["rust"], "date": "2017/02/23 22:27:15", "slug": "try-to-understand-ownership"}